# GetTypeCatalogStringForUnit Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
UnitUtils..::..GetTypeCatalogStringForUnit Method
UnitUtils Class See Also
---
Gets the string used in type catalogs to identify a given unit.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2014
# Syntax
C#
---
```text
public static string GetTypeCatalogStringForUnit(
	ForgeTypeId unitTypeId
)
```

Visual Basic
---
```text
Public Shared Function GetTypeCatalogStringForUnit ( _
	unitTypeId As ForgeTypeId _
) As String
```

Visual C++
---
```text
public:
static String^ GetTypeCatalogStringForUnit(
	ForgeTypeId^ unitTypeId
)
```

# ### Parameters
unitTypeId
    Type: Autodesk.Revit.DB..::..ForgeTypeId Identifier of the unit.
# ### Return Value
The type catalog string, or an empty string if the unit cannot be used in type catalogs.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
UnitUtils Class
Autodesk.Revit.DB Namespace